jyyy3901/GD32_HAL_Compat/Tests/test_tim_host.c
#include "stm32f4xx_hal.h"
#include "gd32_hal_port.h"
#include <assert.h>
#include <stdio.h>
#include <string.h>

static GD32_HAL_TIMERBaseConfig mock_base;
static GD32_HAL_TIMEROCConfig mock_output[4];
static GD32_HAL_TIMERICConfig mock_input[4];
static GD32_HAL_TIMERSlaveConfig mock_slave;
static uint32_t mock_interrupts;
static uint32_t mock_flags;
static uint32_t mock_dma_requests;
static uint32_t mock_counter;
static uint32_t mock_autoreload;
static uint32_t mock_prescaler;
static uint32_t mock_compare[4];
static uint8_t mock_channel_enabled[4];
static uint8_t mock_channel_input[4];
static uint8_t mock_master_trigger;
static int mock_master_slave;
static int mock_enabled;
static int mock_one_pulse;
static int mock_trigger_slave;
static uint32_t mock_base_config_count;
static uint32_t mock_dma_start_count;
static uint32_t mock_dma_abort_count;
static uint32_t mock_dma_source;
static uint32_t mock_dma_destination;
static uint32_t mock_dma_length;
static GD32_HAL_PortError mock_error;
static uint32_t mock_period_callback_count;
static uint32_t mock_oc_callback_count;
static uint32_t mock_pwm_callback_count;
static uint32_t mock_ic_callback_count;
static uint32_t mock_trigger_callback_count;
static const GD32_HAL_Resource mock_dma_ch1_resource =
    {0U, 0U, GD32_HAL_DMA0_CHANNEL1_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     0U, 12, GD32_HAL_CAP_DMA, 0U, 1U};
static const GD32_HAL_Resource mock_dma_ch4_resource =
    {0U, 0U, GD32_HAL_DMA0_CHANNEL4_ADDRESS, GD32_HAL_DMA0_ADDRESS,
     0U, 15, GD32_HAL_CAP_DMA, 0U, 4U};
static HAL_TIM_ActiveChannel mock_callback_channel;

static void mock_reset(void)
{
    memset(&mock_base, 0, sizeof(mock_base));
    memset(mock_output, 0, sizeof(mock_output));
    memset(mock_input, 0, sizeof(mock_input));
    memset(&mock_slave, 0, sizeof(mock_slave));
    memset(mock_compare, 0, sizeof(mock_compare));
    memset(mock_channel_enabled, 0, sizeof(mock_channel_enabled));
    memset(mock_channel_input, 0, sizeof(mock_channel_input));
    mock_interrupts = 0U;
    mock_flags = 0U;
    mock_dma_requests = 0U;
    mock_counter = 0U;
    mock_autoreload = 0U;
    mock_prescaler = 0U;
    mock_master_trigger = 0U;
    mock_master_slave = 0;
    mock_enabled = 0;
    mock_one_pulse = 0;
    mock_trigger_slave = 0;
    mock_base_config_count = 0U;
    mock_dma_start_count = 0U;
    mock_dma_abort_count = 0U;
    mock_dma_source = 0U;
    mock_dma_destination = 0U;
    mock_dma_length = 0U;
    mock_error = GD32_HAL_PORT_ERROR_NONE;
    mock_period_callback_count = 0U;
    mock_oc_callback_count = 0U;
    mock_pwm_callback_count = 0U;
    mock_ic_callback_count = 0U;
    mock_trigger_callback_count = 0U;
    mock_callback_channel = HAL_TIM_ACTIVE_CHANNEL_CLEARED;
}

static TIM_HandleTypeDef mock_handle(TIM_TypeDef *instance)
{
    TIM_HandleTypeDef htim;
    memset(&htim, 0, sizeof(htim));
    htim.Instance = instance;
    htim.Init.Prescaler = 79U;
    htim.Init.CounterMode = TIM_COUNTERMODE_UP;
    htim.Init.Period = 999U;
    htim.Init.ClockDivision = TIM_CLOCKDIVISION_DIV1;
    htim.Init.RepetitionCounter = 0U;
    htim.Init.AutoReloadPreload = TIM_AUTORELOAD_PRELOAD_DISABLE;
    htim.State = HAL_TIM_STATE_RESET;
    return htim;
}

void GD32_HAL_ErrorHook(GD32_HAL_PortError error, uint32_t detail)
{
    (void)detail;
    mock_error = error;
}

int GD32_HAL_TIMER_IsInstance(uint32_t timer_address)
{
    return (timer_address >= GD32_HAL_TIMER1_ADDRESS) &&
           (timer_address <= GD32_HAL_TIMER0_ADDRESS);
}

int GD32_HAL_TIMER_IsChannelValid(uint32_t timer_address, uint8_t channel)
{
    (void)timer_address;
    return channel < 4U;
}

int GD32_HAL_TIMER_IsOnePulseCapable(uint32_t timer_address)
{
    (void)timer_address;
    return 1;
}

int GD32_HAL_TIMER_IsMasterSlaveCapable(uint32_t timer_address)
{
    (void)timer_address;
    return 1;
}

int GD32_HAL_TIMER_ConfigureBase(uint32_t timer_address,
                                 const GD32_HAL_TIMERBaseConfig *config)
{
    (void)timer_address;
    mock_base = *config;
    mock_autoreload = config->period;
    mock_prescaler = config->prescaler;
    ++mock_base_config_count;
    return 0;
}

void GD32_HAL_TIMER_DeInit(uint32_t timer_address) { (void)timer_address; }
void GD32_HAL_TIMER_Enable(uint32_t timer_address) { (void)timer_address; mock_enabled = 1; }
void GD32_HAL_TIMER_Disable(uint32_t timer_address) { (void)timer_address; mock_enabled = 0; }

void GD32_HAL_TIMER_DisableIfIdle(uint32_t timer_address)
{
    uint8_t i;
    (void)timer_address;
    for (i = 0U; i < 4U; ++i) { if (mock_channel_enabled[i] != 0U) { return; } }
    mock_enabled = 0;
}

int GD32_HAL_TIMER_IsEnabled(uint32_t timer_address) { (void)timer_address; return mock_enabled; }
int GD32_HAL_TIMER_IsTriggerSlaveMode(uint32_t timer_address) { (void)timer_address; return mock_trigger_slave; }
void GD32_HAL_TIMER_SetInternalClock(uint32_t timer_address) { (void)timer_address; mock_trigger_slave = 0; }

int GD32_HAL_TIMER_ConfigureOutput(uint32_t timer_address,
                                   uint8_t channel,
                                   const GD32_HAL_TIMEROCConfig *config)
{
    (void)timer_address;
    mock_output[channel] = *config;
    mock_channel_input[channel] = 0U;
    mock_compare[channel] = config->pulse;
    return 0;
}

int GD32_HAL_TIMER_ConfigureInput(uint32_t timer_address,
                                  uint8_t channel,
                                  const GD32_HAL_TIMERICConfig *config)
{
    (void)timer_address;
    mock_input[channel] = *config;
    mock_channel_input[channel] = 1U;
    return 0;
}

void GD32_HAL_TIMER_SetChannel(uint32_t timer_address, uint8_t channel, int enable)
{
    (void)timer_address;
    mock_channel_enabled[channel] = (uint8_t)(enable != 0);
}

int GD32_HAL_TIMER_IsChannelInput(uint32_t timer_address, uint8_t channel)
{
    (void)timer_address;
    return mock_channel_input[channel] != 0U;
}

void GD32_HAL_TIMER_SetOnePulse(uint32_t timer_address, int single)
{
    (void)timer_address;
    mock_one_pulse = single;
}

int GD32_HAL_TIMER_ConfigureMaster(uint32_t timer_address,
                                   uint8_t trigger_output,
                                   int master_slave_enable)
{
    (void)timer_address;
    mock_master_trigger = trigger_output;
    mock_master_slave = master_slave_enable;
    return 0;
}

int GD32_HAL_TIMER_ConfigureSlave(uint32_t timer_address,
                                  const GD32_HAL_TIMERSlaveConfig *config)
{
    (void)timer_address;
    mock_slave = *config;
    mock_trigger_slave = config->slave_mode == 3U;
    return 0;
}

void GD32_HAL_TIMER_SetInterrupt(uint32_t timer_address, uint32_t interrupts, int enable)
{
    (void)timer_address;
    if (enable != 0) { mock_interrupts |= interrupts; }
    else { mock_interrupts &= ~interrupts; }
}

uint32_t GD32_HAL_TIMER_GetInterrupts(uint32_t timer_address) { (void)timer_address; return mock_interrupts; }
uint32_t GD32_HAL_TIMER_GetFlag(uint32_t timer_address, uint32_t flags) { (void)timer_address; return mock_flags & flags; }
void GD32_HAL_TIMER_ClearFlag(uint32_t timer_address, uint32_t flags) { (void)timer_address; mock_flags &= ~flags; }

void GD32_HAL_TIMER_SetDMARequest(uint32_t timer_address,
                                  GD32_HAL_TIMERDMARequest request,
                                  int enable)
{
    (void)timer_address;
    if (enable != 0) { mock_dma_requests |= 1UL << (uint32_t)request; }
    else { mock_dma_requests &= ~(1UL << (uint32_t)request); }
}

int GD32_HAL_TIMER_IsDMAChannelValid(uint32_t timer_address,
                                     GD32_HAL_TIMERDMARequest request,
                                     uint32_t channel_address,
                                     uint32_t request_token)
{
    (void)timer_address;
    return ((request == GD32_HAL_TIMER_DMA_CC1) &&
            (channel_address == GD32_HAL_DMA0_CHANNEL4_ADDRESS) &&
            (request_token == GD32_DMA_REQUEST_TIMER1_CH0)) ||
           ((request == GD32_HAL_TIMER_DMA_UPDATE) &&
            (channel_address == GD32_HAL_DMA0_CHANNEL1_ADDRESS) &&
            (request_token == GD32_DMA_REQUEST_TIMER1_UP));
}

HAL_StatusTypeDef GD32_HAL_DMA_ResolveForTimer(
    DMA_HandleTypeDef *hdma,
    uint32_t timer_address,
    GD32_HAL_TIMERDMARequest request)
{
    if (hdma->GD32_DEFERRED == 0U)
    {
        return HAL_OK;
    }
    if ((timer_address == GD32_HAL_TIMER1_ADDRESS) &&
        (request == GD32_HAL_TIMER_DMA_CC1) &&
        (hdma->Instance == DMA1_Stream5) &&
        (hdma->Init.Channel == DMA_CHANNEL_3))
    {
        hdma->GD32_RESOURCE = &mock_dma_ch4_resource;
        hdma->GD32_INSTANCE = GD32_HAL_DMA0_CHANNEL4_ADDRESS;
        hdma->gd32_dma_periph = GD32_HAL_DMA0_ADDRESS;
        hdma->gd32_dma_channel = 4U;
        hdma->GD32_REQUEST = GD32_DMA_REQUEST_TIMER1_CH0;
    }
    else if ((timer_address == GD32_HAL_TIMER1_ADDRESS) &&
             (request == GD32_HAL_TIMER_DMA_UPDATE) &&
             (hdma->Instance == DMA1_Stream1) &&
             (hdma->Init.Channel == DMA_CHANNEL_3))
    {
        hdma->GD32_RESOURCE = &mock_dma_ch1_resource;
        hdma->GD32_INSTANCE = GD32_HAL_DMA0_CHANNEL1_ADDRESS;
        hdma->gd32_dma_periph = GD32_HAL_DMA0_ADDRESS;
        hdma->gd32_dma_channel = 1U;
        hdma->GD32_REQUEST = GD32_DMA_REQUEST_TIMER1_UP;
    }
    else
    {
        GD32_HAL_ErrorHook(GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED,
                           timer_address | (uint32_t)request);
        return HAL_ERROR;
    }
    hdma->GD32_RESOLVED_FROM = (uintptr_t)hdma->Instance;
    hdma->GD32_DEFERRED = 0U;
    return HAL_OK;
}

