jyyy3901/GD32_HAL_Compat/Tests/test_tim_host.c
uint32_t GD32_HAL_TIMER_GetDMADataAddress(uint32_t timer_address,
                                          GD32_HAL_TIMERDMARequest request)
{
    return timer_address + ((request == GD32_HAL_TIMER_DMA_UPDATE) ? 0x2CU : 0x34U);
}

void GD32_HAL_TIMER_SetCounter(uint32_t timer_address, uint32_t value) { (void)timer_address; mock_counter = value; }
uint32_t GD32_HAL_TIMER_GetCounter(uint32_t timer_address) { (void)timer_address; return mock_counter; }
void GD32_HAL_TIMER_SetAutoReload(uint32_t timer_address, uint32_t value) { (void)timer_address; mock_autoreload = value; }
uint32_t GD32_HAL_TIMER_GetAutoReload(uint32_t timer_address) { (void)timer_address; return mock_autoreload; }
void GD32_HAL_TIMER_SetPrescaler(uint32_t timer_address, uint32_t value) { (void)timer_address; mock_prescaler = value; }
uint32_t GD32_HAL_TIMER_GetPrescaler(uint32_t timer_address) { (void)timer_address; return mock_prescaler; }
void GD32_HAL_TIMER_SetCompare(uint32_t timer_address, uint8_t channel, uint32_t value) { (void)timer_address; mock_compare[channel] = value; }
uint32_t GD32_HAL_TIMER_GetCompare(uint32_t timer_address, uint8_t channel) { (void)timer_address; return mock_compare[channel]; }

HAL_StatusTypeDef HAL_DMA_Start_IT(DMA_HandleTypeDef *hdma,
                                   uint32_t SrcAddress,
                                   uint32_t DstAddress,
                                   uint32_t DataLength)
{
    ++mock_dma_start_count;
    mock_dma_source = SrcAddress;
    mock_dma_destination = DstAddress;
    mock_dma_length = DataLength;
    hdma->State = HAL_DMA_STATE_BUSY;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_DMA_Init(DMA_HandleTypeDef *hdma)
{
    if ((hdma == NULL) || (hdma->Instance == NULL))
    {
        return HAL_ERROR;
    }
    hdma->GD32_DEFERRED = 1U;
    hdma->GD32_RESOURCE = NULL;
    hdma->GD32_INSTANCE = 0U;
    hdma->State = HAL_DMA_STATE_READY;
    return HAL_OK;
}

HAL_StatusTypeDef HAL_DMA_Abort(DMA_HandleTypeDef *hdma)
{
    ++mock_dma_abort_count;
    hdma->State = HAL_DMA_STATE_READY;
    return HAL_OK;
}

void HAL_TIM_Base_MspInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_Base_MspDeInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_OC_MspInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_OC_MspDeInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_PWM_MspInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_PWM_MspDeInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_IC_MspInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_IC_MspDeInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_OnePulse_MspInit(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_OnePulse_MspDeInit(TIM_HandleTypeDef *htim) { (void)htim; }

void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
    ++mock_period_callback_count;
    mock_callback_channel = htim->Channel;
}
void HAL_TIM_PeriodElapsedHalfCpltCallback(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_OC_DelayElapsedCallback(TIM_HandleTypeDef *htim) { ++mock_oc_callback_count; mock_callback_channel = htim->Channel; }
void HAL_TIM_IC_CaptureCallback(TIM_HandleTypeDef *htim) { ++mock_ic_callback_count; mock_callback_channel = htim->Channel; }
void HAL_TIM_IC_CaptureHalfCpltCallback(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_PWM_PulseFinishedCallback(TIM_HandleTypeDef *htim) { ++mock_pwm_callback_count; mock_callback_channel = htim->Channel; }
void HAL_TIM_PWM_PulseFinishedHalfCpltCallback(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_TriggerCallback(TIM_HandleTypeDef *htim) { (void)htim; ++mock_trigger_callback_count; }
void HAL_TIM_TriggerHalfCpltCallback(TIM_HandleTypeDef *htim) { (void)htim; }
void HAL_TIM_ErrorCallback(TIM_HandleTypeDef *htim) { (void)htim; }

static void test_base_and_16bit_boundary(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM2);
    assert(HAL_TIM_Base_Init(&htim) == HAL_OK);
    assert(mock_base_config_count == 1U);
    assert(mock_base.prescaler == 79U);
    assert(mock_base.period == 999U);
    assert(HAL_TIM_Base_Start(&htim) == HAL_OK);
    assert(mock_enabled != 0);
    assert(HAL_TIM_Base_Stop(&htim) == HAL_OK);
    assert(mock_enabled == 0);

    htim.State = HAL_TIM_STATE_RESET;
    htim.Init.Period = 0x10000U;
    assert(HAL_TIM_Base_Init(&htim) == HAL_ERROR);
    assert(mock_error == GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE);
}

static void test_pwm_oc_ic_and_irq(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM3);
    TIM_OC_InitTypeDef oc = {0};
    TIM_IC_InitTypeDef ic = {0};

    assert(HAL_TIM_PWM_Init(&htim) == HAL_OK);
    oc.OCMode = TIM_OCMODE_PWM1;
    oc.Pulse = 250U;
    oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc.OCFastMode = TIM_OCFAST_DISABLE;
    assert(HAL_TIM_PWM_ConfigChannel(&htim, &oc, TIM_CHANNEL_1) == HAL_OK);
    assert(mock_output[0].mode == GD32_HAL_TIMER_OC_PWM1);
    assert(mock_output[0].preload == 1U);
    assert(HAL_TIM_PWM_Start(&htim, TIM_CHANNEL_1) == HAL_OK);
    assert(mock_channel_enabled[0] == 1U);
    assert(HAL_TIM_PWM_Stop(&htim, TIM_CHANNEL_1) == HAL_OK);

    oc.OCMode = TIM_OCMODE_TOGGLE;
    oc.Pulse = 500U;
    assert(HAL_TIM_OC_ConfigChannel(&htim, &oc, TIM_CHANNEL_2) == HAL_OK);
    assert(HAL_TIM_OC_Start_IT(&htim, TIM_CHANNEL_2) == HAL_OK);
    mock_flags |= TIM_FLAG_CC2;
    HAL_TIM_IRQHandler(&htim);
    assert(mock_oc_callback_count == 1U);
    assert(mock_pwm_callback_count == 1U);
    assert(mock_callback_channel == HAL_TIM_ACTIVE_CHANNEL_2);

    ic.ICPolarity = TIM_ICPOLARITY_FALLING;
    ic.ICSelection = TIM_ICSELECTION_DIRECTTI;
    ic.ICPrescaler = TIM_ICPSC_DIV4;
    ic.ICFilter = 3U;
    assert(HAL_TIM_IC_ConfigChannel(&htim, &ic, TIM_CHANNEL_3) == HAL_OK);
    assert(HAL_TIM_IC_Start_IT(&htim, TIM_CHANNEL_3) == HAL_OK);
    mock_compare[2] = 777U;
    mock_flags |= TIM_FLAG_CC3;
    HAL_TIM_IRQHandler(&htim);
    assert(mock_ic_callback_count == 1U);
    assert(mock_callback_channel == HAL_TIM_ACTIVE_CHANNEL_3);
    assert(HAL_TIM_ReadCapturedValue(&htim, TIM_CHANNEL_3) == 777U);

    assert(HAL_TIM_Base_Stop(&htim) == HAL_OK);
    htim.State = HAL_TIM_STATE_READY;
    assert(HAL_TIM_Base_Start_IT(&htim) == HAL_OK);
    mock_flags |= TIM_FLAG_UPDATE;
    HAL_TIM_IRQHandler(&htim);
    assert(mock_period_callback_count == 1U);
    assert((mock_flags & TIM_FLAG_UPDATE) == 0U);
}

static void test_master_slave_and_one_pulse(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM2);
    TIM_MasterConfigTypeDef master;
    TIM_SlaveConfigTypeDef slave;
    TIM_OnePulse_InitTypeDef one_pulse = {0};

    assert(HAL_TIM_Base_Init(&htim) == HAL_OK);
    master.MasterOutputTrigger = TIM_TRGO_UPDATE;
    master.MasterSlaveMode = TIM_MASTERSLAVEMODE_ENABLE;
    assert(HAL_TIMEx_MasterConfigSynchronization(&htim, &master) == HAL_OK);
    assert(mock_master_trigger == 2U);
    assert(mock_master_slave != 0);

    slave.SlaveMode = TIM_SLAVEMODE_TRIGGER;
    slave.InputTrigger = TIM_TS_ITR0;
    slave.TriggerPolarity = TIM_TRIGGERPOLARITY_RISING;
    slave.TriggerPrescaler = TIM_TRIGGERPRESCALER_DIV1;
    slave.TriggerFilter = 0U;
    assert(HAL_TIM_SlaveConfigSynchro_IT(&htim, &slave) == HAL_OK);
    assert(mock_slave.slave_mode == 3U);
    assert(mock_slave.input_trigger == 0U);
    assert((mock_interrupts & TIM_IT_TRIGGER) != 0U);
    mock_flags |= TIM_FLAG_TRIGGER;
    HAL_TIM_IRQHandler(&htim);
    assert(mock_trigger_callback_count == 1U);

    htim.State = HAL_TIM_STATE_RESET;
    assert(HAL_TIM_OnePulse_Init(&htim, TIM_OPMODE_SINGLE) == HAL_OK);
    assert(mock_one_pulse != 0);
    one_pulse.OCMode = TIM_OCMODE_PWM1;
    one_pulse.Pulse = 100U;
    one_pulse.OCPolarity = TIM_OCPOLARITY_HIGH;
    one_pulse.ICPolarity = TIM_ICPOLARITY_RISING;
    one_pulse.ICSelection = TIM_ICSELECTION_DIRECTTI;
    one_pulse.ICFilter = 2U;
    assert(HAL_TIM_OnePulse_ConfigChannel(&htim,
                                          &one_pulse,
                                          TIM_CHANNEL_1,
                                          TIM_CHANNEL_2) == HAL_OK);
    assert(mock_slave.input_trigger == 6U);
    assert(HAL_TIM_OnePulse_Start_IT(&htim, TIM_CHANNEL_1) == HAL_OK);
    assert(mock_channel_enabled[0] == 1U);
    assert(mock_channel_enabled[1] == 1U);
    assert(HAL_TIM_OnePulse_Stop_IT(&htim, TIM_CHANNEL_1) == HAL_OK);
}

static void test_pwm_dma(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM2);
    DMA_HandleTypeDef hdma;
    TIM_OC_InitTypeDef oc = {0};
    uint16_t pulses[] = {100U, 200U, 300U};

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = DMA1_Stream5;
    hdma.Init.Channel = DMA_CHANNEL_3;
    hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma.Init.Mode = DMA_NORMAL;
    assert(HAL_DMA_Init(&hdma) == HAL_OK);

