jyyy3901/GD32_HAL_Compat/Tests/test_tim_host.c
    assert(HAL_TIM_PWM_Init(&htim) == HAL_OK);
    oc.OCMode = TIM_OCMODE_PWM1;
    oc.Pulse = 100U;
    oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    oc.OCFastMode = TIM_OCFAST_DISABLE;
    assert(HAL_TIM_PWM_ConfigChannel(&htim, &oc, TIM_CHANNEL_1) == HAL_OK);
    __HAL_LINKDMA(&htim, hdma[TIM_DMA_ID_CC1], hdma);
    assert(HAL_TIM_PWM_Start_DMA(&htim, TIM_CHANNEL_1,
                                 (const uint32_t *)(const void *)pulses,
                                 3U) == HAL_OK);
    assert(mock_dma_start_count == 1U);
    assert(mock_dma_length == 3U);
    assert(mock_dma_destination == GD32_HAL_TIMER1_ADDRESS + 0x34U);
    assert(hdma.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL4_ADDRESS);
    assert(hdma.gd32_dma_periph == GD32_HAL_DMA0_ADDRESS);
    assert(hdma.gd32_dma_channel == 4U);
    assert(hdma.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_CH0);
    assert((mock_dma_requests & (1UL << GD32_HAL_TIMER_DMA_CC1)) != 0U);
    hdma.XferCpltCallback(&hdma);
    assert(HAL_TIM_GetChannelState(&htim, TIM_CHANNEL_1) == HAL_TIM_CHANNEL_STATE_READY);
    assert(mock_pwm_callback_count == 1U);
    assert(mock_dma_source == (uint32_t)(uintptr_t)pulses);
    assert(mock_channel_enabled[0] == 1U);
    assert((mock_dma_requests & (1UL << GD32_HAL_TIMER_DMA_CC1)) != 0U);
    hdma.State = HAL_DMA_STATE_READY;
    assert(HAL_TIM_PWM_Stop_DMA(&htim, TIM_CHANNEL_1) == HAL_OK);
    assert(mock_channel_enabled[0] == 0U);
    assert((mock_dma_requests & (1UL << GD32_HAL_TIMER_DMA_CC1)) == 0U);

    hdma.Init.Mode = DMA_CIRCULAR;
    assert(HAL_TIM_PWM_Start_DMA(&htim, TIM_CHANNEL_1,
                                 (const uint32_t *)(const void *)pulses,
                                 3U) == HAL_OK);
    hdma.XferCpltCallback(&hdma);
    assert(HAL_TIM_GetChannelState(&htim, TIM_CHANNEL_1) ==
           HAL_TIM_CHANNEL_STATE_BUSY);
    assert(HAL_TIM_PWM_Stop_DMA(&htim, TIM_CHANNEL_1) == HAL_OK);
}

static void test_oc_ic_dma_width_and_guards(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM2);
    DMA_HandleTypeDef hdma;
    TIM_OC_InitTypeDef oc = {0};
    TIM_IC_InitTypeDef ic = {0};
    uint32_t word_values[] = {100U, 0x10000U};
    uint16_t half_values[] = {10U, 20U};
    uint32_t alignment_storage[2] = {0U};
    DMA_HandleTypeDef unsupported;

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = GD32_DMA0_CHANNEL4;
    hdma.Init.Channel = GD32_DMA_REQUEST_TIMER1_CH0;
    hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    hdma.Init.Mode = DMA_NORMAL;
    hdma.State = HAL_DMA_STATE_READY;
    hdma.Parent = &htim;
    htim.hdma[TIM_DMA_ID_CC1] = &hdma;

    assert(HAL_TIM_OC_Init(&htim) == HAL_OK);
    oc.OCMode = TIM_OCMODE_TOGGLE;
    oc.Pulse = 10U;
    oc.OCPolarity = TIM_OCPOLARITY_HIGH;
    assert(HAL_TIM_OC_ConfigChannel(&htim, &oc, TIM_CHANNEL_1) == HAL_OK);
    assert(HAL_TIM_OC_Start_DMA(&htim, TIM_CHANNEL_1, word_values, 2U) ==
           HAL_ERROR);
    assert(mock_error == GD32_HAL_PORT_ERROR_TIMER_16BIT_RANGE);

    word_values[1] = 200U;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    assert(HAL_TIM_OC_Start_DMA(&htim, TIM_CHANNEL_1, word_values, 2U) ==
           HAL_ERROR);
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    assert(HAL_TIM_OC_Start_DMA(
               &htim, TIM_CHANNEL_1,
               (const uint32_t *)(const void *)((uint8_t *)alignment_storage + 1U),
               1U) == HAL_ERROR);

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = DMA1_Stream5;
    hdma.Init.Channel = DMA_CHANNEL_3;
    hdma.Init.Direction = DMA_PERIPH_TO_MEMORY;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    hdma.Init.Mode = DMA_NORMAL;
    assert(HAL_DMA_Init(&hdma) == HAL_OK);
    assert(HAL_TIM_IC_Init(&htim) == HAL_OK);
    ic.ICPolarity = TIM_ICPOLARITY_RISING;
    ic.ICSelection = TIM_ICSELECTION_DIRECTTI;
    ic.ICPrescaler = TIM_ICPSC_DIV1;
    assert(HAL_TIM_IC_ConfigChannel(&htim, &ic, TIM_CHANNEL_1) == HAL_OK);
    __HAL_LINKDMA(&htim, hdma[TIM_DMA_ID_CC1], hdma);
    assert(HAL_TIM_IC_Start_DMA(&htim, TIM_CHANNEL_1,
                                (uint32_t *)(void *)half_values, 2U) == HAL_OK);
    assert(mock_dma_source == GD32_HAL_TIMER1_ADDRESS + 0x34U);
    assert(mock_dma_destination == (uint32_t)(uintptr_t)half_values);
    assert(hdma.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL4_ADDRESS);
    assert(hdma.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_CH0);
    hdma.XferCpltCallback(&hdma);
    assert(mock_ic_callback_count == 1U);
    assert(HAL_TIM_IC_Stop_DMA(&htim, TIM_CHANNEL_1) == HAL_OK);

    memset(&unsupported, 0, sizeof(unsupported));
    unsupported.Instance = DMA1_Stream1;
    unsupported.Init.Channel = DMA_CHANNEL_3;
    unsupported.Init.Direction = DMA_MEMORY_TO_PERIPH;
    unsupported.Init.PeriphInc = DMA_PINC_DISABLE;
    unsupported.Init.MemInc = DMA_MINC_ENABLE;
    unsupported.Init.PeriphDataAlignment = DMA_PDATAALIGN_HALFWORD;
    unsupported.Init.MemDataAlignment = DMA_MDATAALIGN_HALFWORD;
    unsupported.Init.Mode = DMA_NORMAL;
    assert(HAL_DMA_Init(&unsupported) == HAL_OK);
    __HAL_LINKDMA(&htim, hdma[TIM_DMA_ID_CC2], unsupported);
    assert(HAL_TIM_PWM_Start_DMA(
               &htim, TIM_CHANNEL_2,
               (const uint32_t *)(const void *)half_values, 2U) == HAL_ERROR);
    assert(mock_error == GD32_HAL_PORT_ERROR_TIMER_DMA_UNSUPPORTED);
}

static void test_base_dma(void)
{
    TIM_HandleTypeDef htim = mock_handle(TIM2);
    DMA_HandleTypeDef hdma;
    uint32_t periods[] = {999U, 499U};

    memset(&hdma, 0, sizeof(hdma));
    hdma.Instance = DMA1_Stream1;
    hdma.Init.Channel = DMA_CHANNEL_3;
    hdma.Init.Direction = DMA_MEMORY_TO_PERIPH;
    hdma.Init.PeriphInc = DMA_PINC_DISABLE;
    hdma.Init.MemInc = DMA_MINC_ENABLE;
    hdma.Init.PeriphDataAlignment = DMA_PDATAALIGN_WORD;
    hdma.Init.MemDataAlignment = DMA_MDATAALIGN_WORD;
    hdma.Init.Mode = DMA_NORMAL;
    assert(HAL_DMA_Init(&hdma) == HAL_OK);

    assert(HAL_TIM_Base_Init(&htim) == HAL_OK);
    __HAL_LINKDMA(&htim, hdma[TIM_DMA_ID_UPDATE], hdma);
    assert(HAL_TIM_Base_Start_DMA(&htim, periods, 2U) == HAL_OK);
    assert(mock_dma_destination == GD32_HAL_TIMER1_ADDRESS + 0x2CU);
    assert(hdma.GD32_INSTANCE == GD32_HAL_DMA0_CHANNEL1_ADDRESS);
    assert(hdma.GD32_REQUEST == GD32_DMA_REQUEST_TIMER1_UP);
    assert((mock_dma_requests & (1UL << GD32_HAL_TIMER_DMA_UPDATE)) != 0U);
    hdma.XferCpltCallback(&hdma);
    assert(htim.State == HAL_TIM_STATE_READY);
    assert(mock_period_callback_count == 1U);
    hdma.State = HAL_DMA_STATE_READY;
    assert(HAL_TIM_Base_Stop_DMA(&htim) == HAL_OK);
    assert((mock_dma_requests & (1UL << GD32_HAL_TIMER_DMA_UPDATE)) == 0U);
    assert(mock_enabled == 0);
}

int main(void)
{
    mock_reset();
    test_base_and_16bit_boundary();
    mock_reset();
    test_pwm_oc_ic_and_irq();
    mock_reset();
    test_master_slave_and_one_pulse();
    mock_reset();
    test_pwm_dma();
    mock_reset();
    test_oc_ic_dma_width_and_guards();
    mock_reset();
    test_base_dma();
    puts("TIM host tests: PASS");
    return 0;
}
